{
  "paymentFailureSettings": {
    "title": "การตั้งค่าสำหรับการชำระเงินที่ล้มเหลว",
    "cardTitle": "ลองเรียกเก็บเงินใหม่อีกครั้ง",
    "retryAttempts": {
      "label": "จำนวนในการลองเรียกเก็บเงินใหม่อีกครั้ง",
      "helpText": "จำนวนในการลองเรียกเก็บเงินใหม่อีกครั้งต่ำสุด 0 ครั้ง สูงสุด 10 ครั้ง",
      "errors": {
        "min": "จำนวนในการลองเรียกเก็บเงินใหม่อีกครั้งต้องมากกว่า 0",
        "max": "จำนวนในการลองเรียกเก็บเงินใหม่อีกครั้งมากเกินไป"
      }
    },
    "daysBetweenRetryAttempts": {
      "label": "จำนวนวันสำหรับการเว้นช่วงในการลองเรียกเก็บเงินใหม่อีกครั้ง",
      "helpText": "ต่ำสุด 1 วันและสูงสุด 14 วัน",
      "errors": {
        "min": "จำนวนวันสำหรับการเว้นช่วงในการลองเรียกเก็บเงินใหม่อีกครั้งต้องมากกว่า 1",
        "max": "จำนวนวันสำหรับการเว้นช่วงในการลองเรียกเก็บเงินใหม่อีกครั้งมากเกินไป"
      }
    },
    "onFailure": {
      "label": "การดำเนินการเมื่อจำนวนครั้งการลองเรียกเก็บเงินใหม่อีกครั้งทั้งหมดล้มเหลว",
      "options": {
        "skip": "ข้ามการสมัครใช้งานและส่งการแจ้งเตือน",
        "cancel": "ยกเลิกการสมัครใช้งานและส่งการแจ้งเตือน",
        "pause": "หยุดการสมัครใช้งานชั่วคราวและส่งการแจ้งเตือน"
      }
    },
    "notifications": "แก้ไขการแจ้งเตือน",
    "inventoryRetryAttempts": {
      "label": "จำนวนในการลองเรียกเก็บเงินใหม่อีกครั้งเมื่อเกิดข้อผิดพลาดเกี่ยวกับสินค้าคงคลัง",
      "helpText": "จำนวนในการลองเรียกเก็บเงินใหม่อีกครั้งต่ำสุด 0 ครั้ง สูงสุด 10 ครั้ง",
      "errors": {
        "min": "จำนวนในการลองเรียกเก็บเงินสินค้าคงคลังใหม่อีกครั้งต้องมากกว่า 0",
        "max": "จำนวนในการลองเรียกเก็บเงินสินค้าคงคลังใหม่อีกครั้งมากเกินไป"
      }
    },
    "inventoryDaysBetweenRetryAttempts": {
      "label": "จำนวนวันสำหรับการเว้นช่วงลองเรียกเก็บเงินใหม่อีกครั้งเมื่อเกิดข้อผิดพลาดเกี่ยวกับสินค้าคงคลัง",
      "helpText": "ต่ำสุด 1 วันและสูงสุด 14 วัน",
      "errors": {
        "min": "จำนวนวันสำหรับการเว้นช่วงในการลองเรียกเก็บเงินสินค้าคงคลังใหม่อีกครั้งต้องมากกว่า 1",
        "max": "จำนวนวันสำหรับการเว้นช่วงในการลองเรียกเก็บเงินสินค้าคงคลังใหม่อีกครั้งมากเกินไป"
      }
    }
  },
  "saveButtonText": "บันทึก",
  "actions": {
    "updateSuccess": "อัปเดตการตั้งค่าแล้ว"
  },
  "title": "การตั้งค่า"
}
